
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/mongulu-cm/mtchoun-mouh/actions/runs/7688641289)



<pre><code>Apply complete! Resources: 8 added, 2 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Running apply in the remote backend. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/tfc-mongulu-cm/mtchoun-mouh-lambda-layer/runs/run-KqQWU3uP3dK83hZc

Waiting for the plan to start...

Terraform v1.5.4
on linux_amd64
Initializing plugins and modules...
null_resource.lambda_layer: Refreshing state... [id=5409374497015697484]
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=b464fb8901f09f6f02604a785b169e329ec86e39]
data.aws_iam_role.role: Reading...
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=mtchoun-mouh-lambda-layer-trigger_user_scan]
aws_api_gateway_rest_api.api: Refreshing state... [id=3ynishk8t8]
aws_dynamodb_table.Register: Refreshing state... [id=mtchoun-mouh-lambda-layer-Register]
aws_s3_bucket.images: Refreshing state... [id=mtchoun-mouh-lambda-layer-djansang]
data.aws_caller_identity.current: Reading...
aws_s3_bucket.website: Refreshing state... [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]
aws_dynamodb_table.Link_table: Refreshing state... [id=mtchoun-mouh-lambda-layer-Link_table]
aws_dynamodb_table.Users: Refreshing state... [id=mtchoun-mouh-lambda-layer-Users]
data.aws_caller_identity.current: Read complete after 0s [id=053932140667]
data.aws_iam_role.role: Read complete after 0s [id=website-deployer]
aws_lambda_function.scan: Refreshing state... [id=mtchoun-mouh-lambda-layer-scan_user_consulcam]
aws_api_gateway_resource.resource: Refreshing state... [id=ez9l20]
aws_api_gateway_method.method: Refreshing state... [id=agm-3ynishk8t8-ez9l20-POST]
module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-3ynishk8t8-ez9l20-OPTIONS]
module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-3ynishk8t8-ez9l20-OPTIONS-200]
module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-3ynishk8t8-ez9l20-OPTIONS]
aws_api_gateway_method_response.method_response_200: Refreshing state... [id=agmr-3ynishk8t8-ez9l20-POST-200]
aws_cloudwatch_event_target.target: Refreshing state... [id=mtchoun-mouh-lambda-layer-trigger_user_scan-lambda]
aws_lambda_permission.allow_cloudwatch_to_call_check_foo: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-3ynishk8t8-ez9l20-OPTIONS-200]
aws_s3_bucket_public_access_block.website: Refreshing state... [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]
aws_s3_bucket_policy.website: Refreshing state... [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_deployment.test will be created
  + resource "aws_api_gateway_deployment" "test" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "3ynishk8t8"
      + stage_name    = "mtchoun-mouh-lambda-layer-dev"
    }

  # aws_api_gateway_integration.integration will be created
  + resource "aws_api_gateway_integration" "integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "ez9l20"
      + rest_api_id             = "3ynishk8t8"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + arn                            = (known after apply)
      + filename                       = "api/lambda.zip"
      + function_name                  = "mtchoun-mouh-lambda-layer-user_registration_consulcam"
      + handler                        = "lambda.register_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::053932140667:role/website-deployer"
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "sdXkkIUn6SqwHkfapeP2yXoDz63SXDjjp7umyRdXzaU="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all                       = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "API_KEY"         = (sensitive value)
              + "BUCKET_NAME"     = "mtchoun-mouh-lambda-layer-djansang"
              + "ENV"             = "mtchoun-mouh-lambda-layer"
              + "LINKS_TABLE"     = "mtchoun-mouh-lambda-layer-Link_table"
              + "MAINTAINER_MAIL" = (sensitive value)
              + "REGION"          = "eu-central-1"
              + "REGISTERS_TABLE" = "mtchoun-mouh-lambda-layer-Register"
              + "SENTRY_DNS"      = (sensitive value)
              + "USERS_TABLE"     = "mtchoun-mouh-lambda-layer-Users"
            }
        }
    }

  # aws_lambda_layer_version.test_lambda_layer will be created
  + resource "aws_lambda_layer_version" "test_lambda_layer" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "python3.7",
          + "python3.8",
        ]
      + created_date                = (known after apply)
      + filename                    = "python.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "test_lambda_layer"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # aws_lambda_permission.apigw_lambda will be created
  + resource "aws_lambda_permission" "apigw_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "mtchoun-mouh-lambda-layer-user_registration_consulcam"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = "arn:aws:execute-api:eu-central-1:053932140667:3ynishk8t8/*/POST/register"
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

  # aws_s3_bucket.images will be updated in-place
  ~ resource "aws_s3_bucket" "images" {
        id                          = "mtchoun-mouh-lambda-layer-djansang"
        tags                        = {
            "Name"        = "images"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (10 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.website will be updated in-place
  ~ resource "aws_s3_bucket" "website" {
        id                          = "mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm"
        tags                        = {
            "Name"        = "Website"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (12 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_object.example_file will be created
  + resource "aws_s3_bucket_object" "example_file" {
      + acl                    = "private"
      + bucket                 = "mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../html/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # local_file.index_page will be created
  + resource "local_file" "index_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/index.html"
      + id                   = (known after apply)
    }

  # null_resource.lambda_layer must be replaced
-/+ resource "null_resource" "lambda_layer" {
      ~ id       = "5409374497015697484" -> (known after apply)
      + triggers = { # forces replacement
          + "always_run" = (known after apply)
        }
    }

Plan: 8 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  + stage_url      = (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 5 estimated
           $1.74096/mo +$0.0

------------------------------------------------------------------------

null_resource.lambda_layer: Destroying... [id=5409374497015697484]
null_resource.lambda_layer: Destruction complete after 0s
null_resource.lambda_layer: Creating...
null_resource.lambda_layer: Provisioning with 'local-exec'...
null_resource.lambda_layer (local-exec): Executing: ["/bin/sh" "-c" "        /bin/bash\n        pip install virtualenv &&\\\n        virtualenv --python=/usr/bin/python3.8 python &&\\\n        . python/bin/activate &&\\\n        pip install -r api/requirements.txt -t python/lib/python3.8/site-packages &&\\\n        ls python &&\\\n        wget https://mongulu-files.s3.eu-central-1.amazonaws.com/7zz && chmod u+x 7zz &&\\\n        ./7zz a python.zip python/ &&\\\n        ./7zz l python.zip\n"]
aws_s3_bucket.images: Modifying... [id=mtchoun-mouh-lambda-layer-djansang]
aws_s3_bucket.website: Modifying... [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]
null_resource.lambda_layer (local-exec): Collecting virtualenv
null_resource.lambda_layer (local-exec):   Downloading virtualenv-20.25.0-py3-none-any.whl (3.8 MB)
null_resource.lambda_layer (local-exec): Collecting platformdirs<5,>=3.9.1
null_resource.lambda_layer (local-exec):   Downloading platformdirs-4.1.0-py3-none-any.whl (17 kB)
null_resource.lambda_layer (local-exec): Collecting distlib<1,>=0.3.7
null_resource.lambda_layer (local-exec):   Downloading distlib-0.3.8-py2.py3-none-any.whl (468 kB)
null_resource.lambda_layer (local-exec): Collecting filelock<4,>=3.12.2
null_resource.lambda_layer (local-exec):   Downloading filelock-3.13.1-py3-none-any.whl (11 kB)
null_resource.lambda_layer (local-exec): Installing collected packages: platformdirs, distlib, filelock, virtualenv
null_resource.lambda_layer (local-exec): Successfully installed distlib-0.3.8 filelock-3.13.1 platformdirs-4.1.0 virtualenv-20.25.0
null_resource.lambda_layer (local-exec): created virtual environment CPython3.8.10.final.0-64 in 1876ms
null_resource.lambda_layer (local-exec):   creator CPython3Posix(dest=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-KqQWU3uP3dK83hZc/config/python, clear=False, no_vcs_ignore=False, global=False)
null_resource.lambda_layer (local-exec):   seeder FromAppData(download=False, pip=bundle, setuptools=bundle, wheel=bundle, via=copy, app_data_dir=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-KqQWU3uP3dK83hZc/.local/share/virtualenv)
null_resource.lambda_layer (local-exec):     added seed packages: pip==23.3.1, setuptools==69.0.2, wheel==0.42.0
null_resource.lambda_layer (local-exec):   activators BashActivator,CShellActivator,FishActivator,NushellActivator,PowerShellActivator,PythonActivator
null_resource.lambda_layer (local-exec): Collecting beautifulsoup4==4.9.1 (from -r api/requirements.txt (line 1))
null_resource.lambda_layer (local-exec):   Downloading beautifulsoup4-4.9.1-py3-none-any.whl (115 kB)
null_resource.lambda_layer (local-exec):      ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 115.1/115.1 kB 17.6 MB/s eta 0:00:00
null_resource.lambda_layer (local-exec): Collecting certifi==2022.12.7 (from -r api/requirements.txt (line 2))
null_resource.lambda_layer (local-exec):   Downloading certifi-2022.12.7-py3-none-any.whl (155 kB)
null_resource.lambda_layer (local-exec):      ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 155.3/155.3 kB 34.6 MB/s eta 0:00:00
null_resource.lambda_layer (local-exec): Collecting chardet==3.0.4 (from -r api/requirements.txt (line 3))
null_resource.lambda_layer (local-exec):   Downloading chardet-3.0.4-py2.py3-none-any.whl (133 kB)
null_resource.lambda_layer (local-exec):      ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 133.4/133.4 kB 31.4 MB/s eta 0:00:00
null_resource.lambda_layer (local-exec): Collecting idna==2.10 (from -r api/requirements.txt (line 4))
null_resource.lambda_layer (local-exec):   Downloading idna-2.10-py2.py3-none-any.whl (58 kB)
null_resource.lambda_layer (local-exec):      ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 58.8/58.8 kB 17.3 MB/s eta 0:00:00
null_resource.lambda_layer (local-exec): Collecting requests==2.31.0 (from -r api/requirements.txt (line 5))
null_resource.lambda_layer (local-exec):   Downloading requests-2.31.0-py3-none-any.whl.metadata (4.6 kB)
null_resource.lambda_layer (local-exec): Collecting soupsieve==2.0.1 (from -r api/requirements.txt (line 6))
null_resource.lambda_layer (local-exec):   Downloading soupsieve-2.0.1-py3-none-any.whl (32 kB)
null_resource.lambda_layer (local-exec): Collecting zulip==0.8.2 (from -r api/requirements.txt (line 7))
null_resource.lambda_layer (local-exec):   Downloading zulip-0.8.2-py3-none-any.whl (273 kB)
null_resource.lambda_layer (local-exec):      ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 273.5/273.5 kB 43.9 MB/s eta 0:00:00
null_resource.lambda_layer (local-exec): Collecting sentry-sdk==1.14.0 (from -r api/requirements.txt (line 8))
null_resource.lambda_layer (local-exec):   Downloading sentry_sdk-1.14.0-py2.py3-none-any.whl (178 kB)
null_resource.lambda_layer (local-exec):      ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 178.9/178.9 kB 32.5 MB/s eta 0:00:00
null_resource.lambda_layer (local-exec): Collecting python-lambda==11.8.0 (from -r api/requirements.txt (line 9))
null_resource.lambda_layer (local-exec):   Downloading python_lambda-11.8.0-py3-none-any.whl (17 kB)
aws_s3_bucket.images: Modifications complete after 6s [id=mtchoun-mouh-lambda-layer-djansang]
null_resource.lambda_layer (local-exec): Collecting charset-normalizer<4,>=2 (from requests==2.31.0->-r api/requirements.txt (line 5))
null_resource.lambda_layer (local-exec):   Downloading charset_normalizer-3.3.2-cp38-cp38-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.metadata (33 kB)
null_resource.lambda_layer (local-exec): Collecting urllib3<3,>=1.21.1 (from requests==2.31.0->-r api/requirements.txt (line 5))
null_resource.lambda_layer (local-exec):   Downloading urllib3-2.1.0-py3-none-any.whl.metadata (6.4 kB)
null_resource.lambda_layer (local-exec): Collecting matrix-client (from zulip==0.8.2->-r api/requirements.txt (line 7))
null_resource.lambda_layer (local-exec):   Downloading matrix_client-0.4.0-py2.py3-none-any.whl (43 kB)
null_resource.lambda_layer (local-exec):      ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 43.5/43.5 kB 13.1 MB/s eta 0:00:00
null_resource.lambda_layer (local-exec): Collecting distro (from zulip==0.8.2->-r api/requirements.txt (line 7))
null_resource.lambda_layer (local-exec):   Downloading distro-1.9.0-py3-none-any.whl.metadata (6.8 kB)
null_resource.lambda_layer (local-exec): Collecting click (from zulip==0.8.2->-r api/requirements.txt (line 7))
null_resource.lambda_layer (local-exec):   Downloading click-8.1.7-py3-none-any.whl.metadata (3.0 kB)
null_resource.lambda_layer (local-exec): Collecting typing-extensions>=3.7 (from zulip==0.8.2->-r api/requirements.txt (line 7))
null_resource.lambda_layer (local-exec):   Downloading typing_extensions-4.9.0-py3-none-any.whl.metadata (3.0 kB)
aws_s3_bucket.website: Modifications complete after 7s [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]
null_resource.lambda_layer (local-exec): Collecting boto3>=1.4.4 (from python-lambda==11.8.0->-r api/requirements.txt (line 9))
null_resource.lambda_layer (local-exec):   Downloading boto3-1.34.29-py3-none-any.whl.metadata (6.6 kB)
null_resource.lambda_layer (local-exec): Collecting click (from zulip==0.8.2->-r api/requirements.txt (line 7))
null_resource.lambda_layer (local-exec):   Downloading click-6.6-py2.py3-none-any.whl (71 kB)
null_resource.lambda_layer (local-exec):      ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 71.0/71.0 kB 20.2 MB/s eta 0:00:00
null_resource.lambda_layer (local-exec): Collecting PyYAML==5.1 (from python-lambda==11.8.0->-r api/requirements.txt (line 9))
null_resource.lambda_layer (local-exec):   Downloading PyYAML-5.1.tar.gz (274 kB)
null_resource.lambda_layer (local-exec):      ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 274.2/274.2 kB 36.9 MB/s eta 0:00:00
null_resource.lambda_layer (local-exec):   Preparing metadata (setup.py): started
null_resource.lambda_layer (local-exec):   Preparing metadata (setup.py): finished with status 'done'
null_resource.lambd

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

....         8997         3951  python/lib/python3.8/site-packages/wheel/vendored/packaging/__pycache__/_parser.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:58 .....         2852          885  python/lib/python3.8/site-packages/wheel/vendored/packaging/__pycache__/_structures.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:58 .....         5780         3082  python/lib/python3.8/site-packages/wheel/vendored/packaging/__pycache__/_tokenizer.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:58 .....         7057         3533  python/lib/python3.8/site-packages/wheel/vendored/packaging/__pycache__/markers.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:58 .....         2894         1561  python/lib/python3.8/site-packages/wheel/vendored/packaging/__pycache__/requirements.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:58 .....        30389         9289  python/lib/python3.8/site-packages/wheel/vendored/packaging/__pycache__/specifiers.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:58 .....        13385         6519  python/lib/python3.8/site-packages/wheel/vendored/packaging/__pycache__/tags.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:58 .....         4656         2489  python/lib/python3.8/site-packages/wheel/vendored/packaging/__pycache__/utils.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:58 .....        14383         5088  python/lib/python3.8/site-packages/wheel/vendored/packaging/__pycache__/version.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:53 .....         3266         1237  python/lib/python3.8/site-packages/wheel/vendored/packaging/_elffile.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:53 .....         9526         3322  python/lib/python3.8/site-packages/wheel/vendored/packaging/_manylinux.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:53 .....         2676         1197  python/lib/python3.8/site-packages/wheel/vendored/packaging/_musllinux.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:53 .....        10382         2383  python/lib/python3.8/site-packages/wheel/vendored/packaging/_parser.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:53 .....         1431          351  python/lib/python3.8/site-packages/wheel/vendored/packaging/_structures.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:53 .....         5292         1801  python/lib/python3.8/site-packages/wheel/vendored/packaging/_tokenizer.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:53 .....         8208         2686  python/lib/python3.8/site-packages/wheel/vendored/packaging/markers.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:53 .....         2952         1055  python/lib/python3.8/site-packages/wheel/vendored/packaging/requirements.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:53 .....        39206         8221  python/lib/python3.8/site-packages/wheel/vendored/packaging/specifiers.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:53 .....        18355         5197  python/lib/python3.8/site-packages/wheel/vendored/packaging/tags.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:53 .....         5268         1738  python/lib/python3.8/site-packages/wheel/vendored/packaging/utils.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:53 .....        16236         4223  python/lib/python3.8/site-packages/wheel/vendored/packaging/version.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:53 .....           16           16  python/lib/python3.8/site-packages/wheel/vendored/vendor.txt
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:53 .....         7701         2485  python/lib/python3.8/site-packages/wheel/wheelfile.py
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:53 D....            0            0  python/lib/python3.8/site-packages/wheel-0.42.0.dist-info
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:53 .....            4            4  python/lib/python3.8/site-packages/wheel-0.42.0.dist-info/INSTALLER
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:53 .....         1107          655  python/lib/python3.8/site-packages/wheel-0.42.0.dist-info/LICENSE.txt
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:53 .....         2203          964  python/lib/python3.8/site-packages/wheel-0.42.0.dist-info/METADATA
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:53 .....         4201         1721  python/lib/python3.8/site-packages/wheel-0.42.0.dist-info/RECORD
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:53 .....           81           81  python/lib/python3.8/site-packages/wheel-0.42.0.dist-info/WHEEL
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:53 .....          104           74  python/lib/python3.8/site-packages/wheel-0.42.0.dist-info/entry_points.txt
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:54 .....            0            0  python/lib/python3.8/site-packages/wheel-0.42.0.virtualenv
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:00 D....            0            0  python/lib/python3.8/site-packages/yaml
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:00 .....        12012         2295  python/lib/python3.8/site-packages/yaml/__init__.py
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:01 D....            0            0  python/lib/python3.8/site-packages/yaml/__pycache__
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:00 .....        11431         3876  python/lib/python3.8/site-packages/yaml/__pycache__/__init__.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:00 .....         3572         1642  python/lib/python3.8/site-packages/yaml/__pycache__/composer.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:01 .....        19634         7313  python/lib/python3.8/site-packages/yaml/__pycache__/constructor.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:01 .....         3415         1084  python/lib/python3.8/site-packages/yaml/__pycache__/cyaml.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:01 .....         1832          737  python/lib/python3.8/site-packages/yaml/__pycache__/dumper.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:01 .....        25362        10023  python/lib/python3.8/site-packages/yaml/__pycache__/emitter.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:01 .....         2309         1211  python/lib/python3.8/site-packages/yaml/__pycache__/error.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:01 .....         3983         1343  python/lib/python3.8/site-packages/yaml/__pycache__/events.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:01 .....         2173          667  python/lib/python3.8/site-packages/yaml/__pycache__/loader.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:01 .....         1734          724  python/lib/python3.8/site-packages/yaml/__pycache__/nodes.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:01 .....        11933         4440  python/lib/python3.8/site-packages/yaml/__pycache__/parser.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:01 .....         4546         2326  python/lib/python3.8/site-packages/yaml/__pycache__/reader.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:01 .....        10091         4114  python/lib/python3.8/site-packages/yaml/__pycache__/representer.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:01 .....         5487         2587  python/lib/python3.8/site-packages/yaml/__pycache__/resolver.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:01 .....        25278         9427  python/lib/python3.8/site-packages/yaml/__pycache__/scanner.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:01 .....         3329         1669  python/lib/python3.8/site-packages/yaml/__pycache__/serializer.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:01 .....         4944         1583  python/lib/python3.8/site-packages/yaml/__pycache__/tokens.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:00 .....         4883         1038  python/lib/python3.8/site-packages/yaml/composer.py
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:00 .....        27187         4445  python/lib/python3.8/site-packages/yaml/constructor.py
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:00 .....         3846          513  python/lib/python3.8/site-packages/yaml/cyaml.py
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:00 .....         2837          385  python/lib/python3.8/site-packages/yaml/dumper.py
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:00 .....        43006         6558  python/lib/python3.8/site-packages/yaml/emitter.py
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:00 .....         2533          718  python/lib/python3.8/site-packages/yaml/error.py
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:00 .....         2445          526  python/lib/python3.8/site-packages/yaml/events.py
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:00 .....         2061          405  python/lib/python3.8/site-packages/yaml/loader.py
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:00 .....         1440          388  python/lib/python3.8/site-packages/yaml/nodes.py
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:00 .....        25495         3678  python/lib/python3.8/site-packages/yaml/parser.py
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:00 .....         6794         1832  python/lib/python3.8/site-packages/yaml/reader.py
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:00 .....        14189         2888  python/lib/python3.8/site-packages/yaml/representer.py
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:00 .....         8970         2132  python/lib/python3.8/site-packages/yaml/resolver.py
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:00 .....        51277         8869  python/lib/python3.8/site-packages/yaml/scanner.py
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:00 .....         4165          900  python/lib/python3.8/site-packages/yaml/serializer.py
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:00 .....         2573          561  python/lib/python3.8/site-packages/yaml/tokens.py
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 D....            0            0  python/lib/python3.8/site-packages/zulip
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....        62777        13111  python/lib/python3.8/site-packages/zulip/__init__.py
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 D....            0            0  python/lib/python3.8/site-packages/zulip/__pycache__
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....        47414        16644  python/lib/python3.8/site-packages/zulip/__pycache__/__init__.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....          983          656  python/lib/python3.8/site-packages/zulip/__pycache__/api_examples.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....         4397         2078  python/lib/python3.8/site-packages/zulip/__pycache__/cli.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....         2750         1593  python/lib/python3.8/site-packages/zulip/__pycache__/send.cpython-38.pyc
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....          919          432  python/lib/python3.8/site-packages/zulip/api_examples.py
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....         4876         1395  python/lib/python3.8/site-packages/zulip/cli.py
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 D....            0            0  python/lib/python3.8/site-packages/zulip/examples
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....          752          327  python/lib/python3.8/site-packages/zulip/examples/alert-words
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....         1142          483  python/lib/python3.8/site-packages/zulip/examples/create-user
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....          450          254  python/lib/python3.8/site-packages/zulip/examples/delete-message
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....          364          210  python/lib/python3.8/site-packages/zulip/examples/delete-stream
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....          981          456  python/lib/python3.8/site-packages/zulip/examples/edit-message
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....         1334          493  python/lib/python3.8/site-packages/zulip/examples/edit-stream
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....         2037          903  python/lib/python3.8/site-packages/zulip/examples/get-history
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....         1456          508  python/lib/python3.8/site-packages/zulip/examples/get-messages
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....          490          297  python/lib/python3.8/site-packages/zulip/examples/get-public-streams
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....          384          221  python/lib/python3.8/site-packages/zulip/examples/get-raw-message
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....          416          239  python/lib/python3.8/site-packages/zulip/examples/get-stream-topics
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....          450          270  python/lib/python3.8/site-packages/zulip/examples/get-subscriptions
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....          402          238  python/lib/python3.8/site-packages/zulip/examples/get-user-presence
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....          509          311  python/lib/python3.8/site-packages/zulip/examples/list-users
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....          386          220  python/lib/python3.8/site-packages/zulip/examples/message-history
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....          645          333  python/lib/python3.8/site-packages/zulip/examples/mute-topic
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....          832          475  python/lib/python3.8/site-packages/zulip/examples/print-events
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....          641          376  python/lib/python3.8/site-packages/zulip/examples/print-messages
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....          296          185  python/lib/python3.8/site-packages/zulip/examples/realm-emoji
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....          837          366  python/lib/python3.8/site-packages/zulip/examples/send-message
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....          644          353  python/lib/python3.8/site-packages/zulip/examples/subscribe
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....          614          342  python/lib/python3.8/site-packages/zulip/examples/unsubscribe
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....          660          332  python/lib/python3.8/site-packages/zulip/examples/update-message-flags
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....         1025          560  python/lib/python3.8/site-packages/zulip/examples/upload-file
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....         4632         1879  python/lib/python3.8/site-packages/zulip/examples/welcome-message
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....          118          100  python/lib/python3.8/site-packages/zulip/examples/zuliprc
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....            0            0  python/lib/python3.8/site-packages/zulip/py.typed
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....         3285         1163  python/lib/python3.8/site-packages/zulip/send.py
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 D....            0            0  python/lib/python3.8/site-packages/zulip-0.8.2.dist-info
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....            4            4  python/lib/python3.8/site-packages/zulip-0.8.2.dist-info/INSTALLER
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....         7143         2904  python/lib/python3.8/site-packages/zulip-0.8.2.dist-info/METADATA
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....        21910         5415  python/lib/python3.8/site-packages/zulip-0.8.2.dist-info/RECORD
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....            0            0  python/lib/python3.8/site-packages/zulip-0.8.2.dist-info/REQUESTED
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....           92           92  python/lib/python3.8/site-packages/zulip-0.8.2.dist-info/WHEEL
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....          191          116  python/lib/python3.8/site-packages/zulip-0.8.2.dist-info/entry_points.txt
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:02 .....           19           19  python/lib/python3.8/site-packages/zulip-0.8.2.dist-info/top_level.txt
null_resource.lambda_layer (local-exec): 2024-01-28 21:59:55 .....          209          143  python/pyvenv.cfg
null_resource.lambda_layer (local-exec): ------------------- ----- ------------ ------------  ------------------------
null_resource.lambda_layer (local-exec): 2024-01-28 22:00:06           58224524     26912710  4270 files, 1194 folders
null_resource.lambda_layer: Creation complete after 26s [id=3717431181789917071]
aws_lambda_layer_version.test_lambda_layer: Creating...
aws_lambda_layer_version.test_lambda_layer: Still creating... [10s elapsed]
aws_lambda_layer_version.test_lambda_layer: Creation complete after 12s [id=arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer:4]
aws_lambda_function.lambda: Creating...
aws_lambda_function.lambda: Still creating... [10s elapsed]
aws_lambda_function.lambda: Creation complete after 12s [id=mtchoun-mouh-lambda-layer-user_registration_consulcam]
aws_lambda_permission.apigw_lambda: Creating...
aws_api_gateway_integration.integration: Creating...
aws_api_gateway_integration.integration: Creation complete after 1s [id=agi-3ynishk8t8-ez9l20-POST]
aws_api_gateway_deployment.test: Creating...
aws_lambda_permission.apigw_lambda: Creation complete after 1s [id=AllowExecutionFromAPIGateway]
aws_api_gateway_deployment.test: Creation complete after 1s [id=8ngckq]
local_file.index_page: Creating...
local_file.index_page: Creation complete after 0s [id=e4d6f8d9f04a2bf779019c6d7d2fd06db0e49bec]
aws_s3_bucket_object.example_file: Creating...
aws_s3_bucket_object.example_file: Creation complete after 1s [id=index.html]

Apply complete! Resources: 8 added, 2 changed, 1 destroyed.

Outputs:

register_table = "mtchoun-mouh-lambda-layer-Register"
stage_url = "https://3ynishk8t8.execute-api.eu-central-1.amazonaws.com/mtchoun-mouh-lambda-layer-dev"
website_url = "http://mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm.s3-website.eu-central-1.amazonaws.com"

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"deploy","PRNumber":144,"Program":"tfcmt","SHA1":"df10ad1a4141c7a121f4104594357cc42d40c9a0","Vars":{},"WorkflowName":"Deploy cases"} -->